{"Apple AirPods (2nd Generation)": ["Everyone is posting that there isn’t a difference between these and the 1st gen.  This is misleading and inaccurate.  Is the improvement drastic, no, but it is still an improvement.  The improvement is that Apple has upgraded the on-board chip to the H1, which leads to faster and more stable pairing.  This isn’t anecdotal.  It’s been tested and proven to be faster.Also, if you opt for wireless charging, buy the case with the gen 2 AirPods and you’ll save a few dollars.If you already have the 1st gen, then it’s probably not worth the upgrade.  If you are looking to buy your first pair of AirPods, then go for these.", "These AirPods are amazing they automatically play audio as soon as you put them in your ears and pause when you take them out. A simple double-tap during music listening will skip forward. To adjust the volume, change the song, make a call, or even get directions, just say \"Hey Siri\" to activate your favorite personal assistant. Plus, when you're on a call or talking to Siri, an additional accelerometer works with dual beamforming microphones to filter out background noise and ensure that your voice is transmitted with clarity and consistency.Additionally, they deliver five hours of listening time on a single charge, and they're made to keep up with you thanks to a charging case that holds multiple additional charges for more than 24 hours of listening time. Just 15 minutes in the case gives you three hours of listening to time or up to two hours of talk time.I would highly recommend it to anyone looking to buy", "These are great but not much better then gen1. Only addition is Siri feature. I will rather buy the previous model on discount and Save some green.", "My son really wanted airpods but his parents thought that they were a waste of money so I bought them for him behind their back and he loves them!! He has wanted them for a while now and these are really good quality!! Real things!! He wore them all day long!! Glad he's thankful!! God Bless, Margaret (Michael's mother)", "I had the AirPods for only a few days.. every time I opened the charging case (after couple hours - enough time for charging), the left earplug was always at very low battery (0-5%), but the right one is fully charged. So I returned it.", "Excellent, pretty useful... easy to use and reliable. At first I had some doubts about it being reliable to my Mac as some Bluetooth speakers sometimes cut off, but these work great and are really comfortable to my ears. Aesthetically, they look great to me.Worth every penny.", "Poor quality microphone. Not suitable for a remote worker taking calls. If your job requires dictation or a high quality mic, go elsewhere", "Got it for my wife’s birthday. Since XS doesn’t have the old headphone plugs, AirPods work perfectly. More importantly she loves it. Sound effect is pretty good too.", "We bought a brand new set of AirPods for $159. After using them for a week, I was listening to them and the right air pod went dead. I figured, maybe I just need to charge them. So when I got home I charged them, and the next day I went to use them again and the right air bud was still dead. So I did some research, tried to reset them, and then I couldn't reconnect them to my phone at all.Once I contacted Apple, they tried to give us the run around. They wanted us to let them fully die, which makes sense, so we did that. Then, when they still didn't work we wanted to exchange the faulty pair for a new set (BECAUSE WE PAID 159 DOLLARS AND ONLY USED THEM FOR A WEEK). Keep in mind, they were taken care of, not dropped, no water damage, they were expensive so they were treated delicately.  Apple wanted a $180 deposit to get a new set, which is MORE THAN WHAT I ORIGINALLY PAID FOR.I decided to contact Amazon, and they suggested contacting Apple, but once I explained what was going, on Amazon offered to make things right and send out a replacement. Never had an issue with Amazon's customer service, but Apple was extremely disappointing. I won't purchase these again.", "They are amazing. It's as simple as just opening the case and you're in. Sound quality isn't the best for headphones at this same price but the convenience is where you will be satisfied."], "Apple AirPods with Wireless Charging Case": ["After 10 15 minutes of use my ears started burning when I got home I noticed that I had bleeding open wounds on my ears located where the airpods rest. I'm glad I wasn't more seriously injured. The pain continued for over 6 hours even after washing the area.", "I ordered these the 1st day they were available and received them today.  They connected easily but on the 1st song I played the audio started slowing down less than a minute in and distorted the vocals and music.  I thought maybe it’s just a glitch because they are only 75% charged so I charged them up and reconnected them and it was even worse than before.  I called Apple support and spoke to 2 women who were beyond slow and the opposite of geniuses.  I was told the 2nd one was a senior supervisor not sure what her qualifications were as she was as inept and unhelpful as her subordinate. After 37 minutes on the call timer and being on hold over 5x I hung up.  I’m going to the Apple store tomorrow.  So I went to the Apple store and with help from the guys there we were able to determine the music issue only happens with Amazon music -  which is my service of choice.  I’ve been checking everyday for an update to fix this glitch.  Apple said they will take them back if one doesn’t come out in the next week or so.  I hate being a casualty in someone’s else’s war....😕Alright there is a workaround - Settings-Amazon Music-Turn Microphone to Off.  Then when you pull up Amazon Music deny permission for microphone access for Alexa.  It fixes the distortion issue when playing music but then I have to turn it back on when I’m using it in the car.  So I’m updating my rating from 2 stars to 3 stars.  If they release an update so I can use Alexa again I’ll raise it up higher.", "I go to the gym and with these they were so good my head exploded in tiny pieces", "Does not work properly with amazon music. Slows down and speeds up randomly, mostly when switching apps. My other pair of wireless headphones still works fine with amazon music. So it must just be the AirPods. Works perfectly fine with Apple Music, no glitches, but I do not have the Apple Music subscription... so this is clearly a ploy by Apple to get people to solely use their music app. Pretty annoyed by it since I have the amazon music with my amazon prime subscription.", "Perfect! Came brand new in the box, almost fully charged, everything perfect and sealed.", "While we have to wait and see the long term reviews of gen2 airpods but for now I will stick with gen1 as there doesn't seem to be a huge improvement.  Will be buying them on discount  now  hopefully around 100 bucks.", "This was a gift for my son. He’s very happy with these and says the sound is really good. He loves that he can use “Hey Siri” and says they fit perfectly in his ears, staying while he runs around with his dog. He has zero complaints.", "I normally don’t write reviews but I’ve spent hours trying to resolve the issues with this order today that I want to save someone else the time . Don’t buy this product from this source . My airpods looked brand new / unopened box but turns out they were used and not reset , did not pair with any device we tried and didn’t even have correct functions after talking to apple . Not sure if it’s fake, refurbished , etc but save your time and money.", "These are not Apple air pods.  They are fake.  My son spent his own money and got scammed."], "Apple AirPods Pro": ["Like iphone 11 Pro, Macbook Pro, Airpad Pro; the \"Pro\" denotes a higher end product.Compared to the Airpods (version 2) highest end model (with wireless charging case*); the Airpods Pro is $50 more MSRP.Compared to the non wireless case version it's $90 more*Airpods Pro does have wireless charging case by default. Only one version.Let's go through the differences1. Physical Appearance:Shorter Stem, but larger bud or headThere's a large black airflow grillA mic inside and outside the AirpodsCase is same thickness, a lot wider, but shorter. Still uses lighting cable to charge, but it does come with a lighting to USB-C cable2. In-ear, instead of on-earIf your ear has a small cavum and the original airpods fit perfectly, then the Airpads Pro may be a tight fit/more uncomfortable, but seeing the in-ear design, the ear piece will go into the ear canal and the rest will float in place.Those with normal or larger cavum it'll fit well.Some may not like the ear piece going into their ear canalThese ear phones are more for a closed environment than an open oneSeeing that it's an in-ear design, you may feel this hollow air effect going on unless you turn on transparency mode (more on this later) or play music with active noise cancelling onSeeing that it's in-ear, it has a tighter grip, better for joggers, those who shake their head around a lot for some reason, or if you run up stairs often. If you have an intense workout regimen and/or do extreme sports and not mindful it still can fall outThere's a Ear Tip Fit Test on app. There's several ear tips in box. When you turn on this feature in app it'll calibrate and suggest what ear tips are best listening experience for youIf you lose the tips or get them dirty overtime, you can go to the Apple store and get replacement pair for around $4 or get cheaper 3rd party ones when they come out3. Squeeze instead of tapInstead of tapping on the earbuds, you are pinching or squeezing the stem.1x to play, pause, and answer calls2x to skip forward tracks3x to skip back tracksPress and hold to switch between active noise cancel and transparency modeStill able to say \"Hey Siri\" to do voice commands/adjust volume anytimeNo physical volume controls on buds4. Battery lifeBattery life varies depending on how far away you are from the device and volume you set. Battery depreciation over time. These are just rough estimatesPro in general has 4.5 listening time with active noise cancelling or transparency on. Airpods version 2 has 5 hours. Note Airpod version 2 does not have active noise cancelling or transparency mode.  You can get 5 hours with noise cancelling and transparency off, but most likely you're not going to unless you're really desperate for batteryPro has 3.5 talk time. Airpods have 3 hoursCase both old 24 hours battery lifePro: 5 mins in case = 1 hour talk or listen time. Airpods 15min in case = 3 hours listen, 2 hours talk5.  Water/sweat resistantNow you can go to the gym and do cardio with them on.As mentioned before, tighter grip seeing that it's in-earMay survive light rain. Do not recommended going in the shower or dunk in the pool with it though 6. Active noise cancellation, Transparency modeAirpods pro has 3 modes: Active noise cancellation, off and Transparency modeActive nose cancellation tries to block out outside noise while listening to music. I'd say it drowns out may 70%. If you focus to outside or aren't focused to music; you still may be able to pick out what's going on, but in general it does it's job.Off is just like the standard in-ear headphones, but with the hollow air sound when no music is playingTransparency mode. The black airflow grills let in outside sound so you're able to hear both outside sound and music same time. Think of it as open ear headsets.Unlike some in-ear headsets the black airflow grills prevent you from hearing yourself in your head when you talk7. Sound QualityBetter than the previous version seeing the active noise cancelling and in-ear with more focused sound direcly into your ear canal. It's not $250 audiophile quality sound.  Better quality sound in lows and mids compared to non-pro version. If you ever tried the Power Beats Pro, it sound very similar to thoseYou can hear callers better in a noisy environment and less likely raise your voice--Conclusion:Other than that, all other features are the same. Meant to be used on Apple devices. Very good ease of use for Apple users, and is in-style these days (shows social status). Sound quality is better that the non-PRO version, and you do get noise cancellation. There are other headphones that do it better sound in this price range, but may not be as convenient with pairing to Apple devices.", "With the new transparency mode, I can listen to music knowing that I will never be ran over by a car on the street again. Another W for Tim Cook and the boys", "Love Apple products but I’m tired of their gamesWith the iPhone 11 they introduced the new charging end (not the one that goes into the phone, the one that plugs into the cube then into the receptacle).The AirPods pro comes with the same cable but no cube. This means if you don’t have an iPhone product you can’t charge these period. And the charging wire it comes with is worthless unless you’ve already bought an iPhone 11Apple charges a ridiculous premium for their products. They should back it with the proper hardware", "They fire", "These earphones are top of the line.Here are some Highlighted FeaturesThey HaveIPX4 rated to resist sweat and water, making them ideal for sports and exercise.Internally tapered tips conform to your ear shape while vents help equalize pressure for maximum comfort.Active Noise Cancellation continuously adapts to the geometry of your ear and the fit of the eartips to keep you isolated from the world around you.Press and hold the force sensor on the stem to switch between Active Noise Cancellation and Transparency Mode, which allows outside sound in to keep you aware of your environment.Expanded mesh microphone port increases call clarity in windy locations.H1 headphone chip features 10 audio cores for low processing latency and real-time noise cancellation.Bluetooth 5.0 for reliable, high-quality reception.Automatically on, automatically connected.Voice-enabled access to Siri.Audio Sharing enables you and a friend to enjoy the same song or movie by simply bringing a second pair of AirPods close to your iPhone or iPad.More than 24-hour battery life with charging case", "Wow! I never liked the original air pods. They always fell off. I’m so glad Apple came out with these and that I waited to splurge on headphones. The sound is beautiful, the fit is perfect. I literally just got these out the box and I fell in love! I have always been an Apple product lover. Well worth the wait!", "I’m gonna start off saying that the noise canceling is amazing ide rate 10/10. Where the problem is is after wear for 3 minutes it begins to hurt my ears dramatically. I tried every tip and none of them work. It seems to be the design of the earbud itself. I’ve personally loved all of apples products but I think they should have worked a little harder on this one. I’ve done research and I’m not the only one experiencing pain. There is thousands who say the same thing. The original AirPods are great and feel amazing in my ears where sometimes I forget I’m wearing them. If you have normal AirPods I would say your better off just using them.", "So I will say I'm never wearing my bose 700's out in public (other than planes and other modes of transport that are too loud for the small in ear noise cancelation the Airpods pro have) there just too bulky and, but these new airpods are just so sleek and convenient, I'm an audio nerd if you want convenience these are probably the best buds to buy right now. Obviously sound could be better but for what you get I'd say it's worth every penny.Seif Afyouni.", "Looks like a knock-off. The touch functionality doesn't work at all and the box didn't even come with a wall adapter and I paid almost $300 for this?UPDATE - right airpod stopped working. 100% a knock-off. DO NOT BUY.", "1 of them only lasted 3 days and then this happened. Call support and they said to return them."], "New Apple AirPods Pro": ["These are really nice earphones.  I've had mine for about a year and have enjoyed them from the start.  Once you find the right size of rubber inserts they stay in your ears better.  The Noise Canceling feature is really nice especially when it comes to trying to listening to music or a phone call with loud background noise.  I have also used these as hearing aids to listen to conversations when your friends are speaking low/whispering.", "These little things pack one hell of a punch!Apple’s new noise cancellation and transparency modes lay the groundwork for a new generation of wireless headphones. Yes others may have used similar technology before, but Apple’s simplistic UI made for the airpods pro make the experience so much better than what other companies offer.Coming from the first generation airpods, the experience is like night and day. Even though the airpods themselves are heavier, they feel lighter in the ears and much more comfortable. The audio quality is insane, and this quality is only amplified by Apple’s new spatial audio.I definitely recommend these.", "How unbelievably annoying it is to spend this amount and not be provided a power adaptor! If you buy these and do not happen to have a USB-C power adaptor, be prepared to spend an additional $20 for the adaptor and wait another 2 days to get it. Stupid!", "Slight upgrade from original AirPod Pros because of the magsafe charging, everything else seem same as last gen but, still great headphones and love the noise cancellation feature!"], "New Apple AirPods (3rd Generation)": ["I don't understand why people feel the need to post their their non-verified purchase reviews(basically opinions) of new Apple products. But since I got mine today and all the reviews are from people who haven't even seen, let alone used the new 3rd gen AirPods, I will give my initial impressions.These are the successor to the standard, 2nd gen AirPods released in the spring of 2019. These keep the open design without eartips, but adapted the look and control system of the AirPods Pro. These also get wireless charging by default (like the AirPods Pro), as well as MagSafe charging (something that the AirPods Pro were updated with after these were announced). I am an Apple fan, for sure, and I own all versions of the AirPods that are currently sold as well as the Beats Studio Buds. Some people think that these aren't worth $180 because the Pro model already exists and sells for $180-200 usually, even though the list price is $250.These do not have the active noise cancellation feature that the AirPods Pro or Beats Studio Buds have, but I think people are forgetting that some people don't like using earbuds with tips that go into your ear canal. That is one of the the things that made AirPods so popular in the first place, plus the fact that they are made by Apple. There aren't a ton of options for premium, open true wireless earbuds with the universal fit that AirPods offer, there just not as common as the kind with silicon eartips. And there is no way to use the AirPods Pro without also using the eartip, they won't stay in place like theses 3rd gen AirPods will.The bud itself is larger on these compared to the previous model with the longer stems, so these feel a bit different when you put them in your ear. I got used to it pretty quickly and they are really comfortable, they stay in place really well for my ear shape. These have the force squeeze controls that the Pros have and it is so much better to use than the old tap controls. If you haven't used this controls system before, you will most likely enjoy using it more because the bud doesn't get pressed into your ear when you need to pause the music and you get more options for controlling playback.The other big upgrade here is the sound quality along with Spatial Audio which works just as well as it does on the AirPods Pro. The sound quality now is pretty much on par with the AirPods Pro, some reviewers have even said it's better. It includes the Adaptive EQ feature where the earbuds are constantly re-adjusting the sound to give you the best quality audio based on your surroundings. Spatial Audio is kind of hard to explain but I will try my best, instead of having a static left and right channel audio, the audio sounds like it's all around you. For Video, it makes the sound seem like it's coming from where the video is playing (your iPhone or iPad or Apple TV). Think about if you are listening to music from a speaker that is in front of you, if you turn your head to the left, your right ear is going to be hearing more of the audio because your left ear is now facing away from the speaker. That is what it's like with spatial audio using the new AIrPods when you watch a video on your iPhone. The AirPods use the sensors in the earbuds as well as in your iPhone to make it sound like the audio is in front of you. It really is awesome and it's one of my favorite features of these AirPods, the older 2nd generation did not include this feature but the Pro model does.The last thing to mention is these AirPods now have better sensors for detecting when they aren't in your ear, even the Pro model doesn't have the new skin detection sensors. This means that if you take out your earbuds and put them in your pocket or a dark place like a drawer, the AirPods will not be fooled and won't accidentally un-pause your music until you put them back in your ear. The old model used optical sensors that were good, but not this good.Pros+Wireless Charging+MagSafe charging comes standard (before you had to pay extra)Spatial Audio for watching videos and for supported songs through Apple MusicOpen design that doesn't require the use of eartips you have to put in your ear canalMuch improved sound quality over the previous generation (AIrPods 2)New force touch sensors like the AirPods ProBetter in-ear detection thanks to skin detection sensorsImproved call quality, Apple is using a new codec for voice calls (AAC-ELD)Longer Battery Life (6 hours) [compared to 5 hours on Airpods 2 and 4.5 hours on AIrPods Pro]Better support from the Find My app, there is now a precision finding feature similar to AirTags and you can ring them while they are still in the case (only available on the new AirPods 3)Cons-No Active Noise Cancellation because of the open designThe AIrPods Pro can sometimes be had for roughly the same price", "These are a step up from the Airpods 2, the new drivers bring out more bass, for me these are a win, I am still waiting for my pair to be delivered from Amazon (should be here today) but couldn’t wait so I bought another pair in store, I cannot use in ear headphones with rubber tips cause they slip out, I’ve tried jabras, Samsung, seinheiser etc, all start slipping with in 20 minutes and I have to push back in, With these Airpods I can run and workout and they stay in, These are the best fit so far, sound quality is also a step up, I highly recommend over the pros even though you don’t get noise canceling", "The first airpods were better. I haven’t owned the AirPods Pro. Probably will never own them after buying these. None of the controls work as they should. You can “pinch” all the times you want and they will not recognize anything. What a waste of money. I had to turn the volume all the way up and they are barely loud. Huge disappointment.", "If you don't care about noise cancellation or transparency mode, then these are the best airpods to get. The sound quality is amazing, and they sit comfortably in my ears, especially for long periods of time. For me personally, the rubber tips on the pros weren't the most comfortable even with shorter usage time. These are perfect for me, definitely would recommend it if you're looking to get your first pair of airpods or upgrading from the 1st or 2nd gen ones.", "I'm comparing these to the AirPods Pro. These are excellent for those who want to save a few bucks and don't need the active noise cancelation. They're everything the AirPods 1 and 2 are, it better and more compact!Sound - Warm and balanced. There's bass! These sound great for earbuds with no silicone or foam ear tips. It's very hard to get excellent sound quality without a seal in the ear and Apple has figured it out with these AirPods! Clarity isn't amazing, but that's a good thing because instead of boosting the treble to create fake clarity and ruin the sound, apple played the strengths of their driver and created a flat tonal curve. Makes listening to songs very enjoyable and not harsh nor muddy.Fit - Super lightweight! They'll stay in your ears. They're so much lighter than the AirPods Pros. I was genuinely surprised when I pulled it out of the case. This is a good thing! One gripe about the AirPods Pro was its slightly heavy and has ear tips which plug into your ear canals. These don't. That means they'll just disappear in your ears and you'll definitly forget it's there. Wait, I'm wearing something?? Currently listening to music on these while writing this review.Style - Honestly, AirPods 3 and Pro look the best in the market. Other earbuds look like a huge round hearing aid sticking out of you ear. With the shorter stem on these, it'll be a huge upgrade to the previous Gen AirPods. No more silly long white stem sticking out of the ear, it looked hideous in my opinion for people who don't know that the stem is supposed to point directly down and / or towards your mouth, NOT pointing slightly away from you.And NO, I'm not an apple fan boy. I use a fully custom built PC and have been rocking android for all my life. Apple just makes incomparable products and earbuds just happen to be one of them.", "The sound quality is what you would expect from Apple. Overall, I’m happy. They do sound better than the original AirPods.", "Huge upgrade from my 1st gen AirPods. Great sound and great microphone quality for calls.", "Eh is all I can say. Honestly, I had high expectations about these new AirPods. As a airpods lover. There is no difference the 1st and this one, only thing is the size of the headphone that go in your ears. Don’t upgrade. Stick with the OG airpods, way better. Thinking of returning.", "Bought these to upgrade from the 2nd gen never got the pros because I personally don’t like in ear buds, but the sound quality is definitely better than the 2nd gen with much better bass and touch controls work way better then the tap function. Also to view your warranty go to your settings on your iphone then bluetooth then select info on your new air pods and scroll all the way to the bottom to see your warranty. In all this was a great purchase and definitely enjoying all the features on these", "Feels like the gen 2 but lighter. Sound is amazing!"], "(Renewed) Apple AirPods 2 with Charging Case - White": ["My husband bought these headphones for me today on 5/28/20 as a random surprise and yea lol this was exactly how they came. This isn’t “renewe” at all. Lol they’re  literally right outta somebody’s ears and put into a Apple box... this is unacceptable for gently used/ refurbished. This is absolutely disgusting. Please save your money, and look at the reviews. We’re all saying the same exact thing. We’ll be getting our money back and buying brand new ones for a few extra dollars. ITS WORTH IT!", "My fiancé surprised me with AirPods for my birthday. I was so excited to try them out..! I had to drive across town to pick them up at FedEx, ok fine whatever. The packing slip with the AirPods says UPS? Somethings up. Should have been warning #1. They are dirty, scratched, and with ear wax. Gross! I was really excited about them, so I decided to look past it (“Renewed”) and just disinfect them, clean them and move on. Ok, now I’m pissed... I couldn’t even try them out! They are completely dead AND the right AirPod doesn’t work!!! AMAZON, HELLO! Inactivate this seller, have you seen the reviews on here?? Unacceptable. Refund please.", "I paid for the series 2 AirPods and when I received the box it was the series 1. Needless to to say I was disappointed. But at least the AirPods I received are in good working order.", "Renewed? Nope. Only one of the earbuds worked. Requested a replacement and was forced to simply get a refund. Now I have to go out of my way to get a refund by returning the airpods within 90 days to get my money back. I have lost confidence in Amazon renewed products and will never buy again. Thanks Amazon. Buyer beware, if you purchase a set of renewed airpods, you may be getting the ones I am returning.", "They work and they are 2nd generation. However I spent an hour cleaning out Stacy’s earwax and I know it was Stacy because they weren’t factory reset.", "I purchased these for over $130.00. I didn't realize they were renewed, but the lower price should've let me know. However, renewed means that they should work like new. However these were comparable to cheap Walmart headphones. Sound quality was terrible. The headphones would die after two or three phones calls, or 5 minutes of music. Save yourself the headache and don't buy these.", "Case was scratched. Inside case was dirty. Bruh, there was ear wax in them. For real for real? Why would you even try to sell this to someone at the same cost as a new one. Renewed is a very deceitful description of what these are. I’m sure you’ll just send them out to the next person who falls for this posting instead of throwing them in the trash when you receive them back from khols. Just not right.", "Great condition and great quality", "Only giving a one star because I received Apple EarPods instead", "I was a laggard, using wired ear buds. I am glad I bit the bullet, I really like them. I set them up so that I can stop and start and move songs forward. I tried a phone call and that worked well. I changed the sounds for notifications (so my ear drums weren't assaulted when someone texted me) and all is good.  I don't want to use siri or alexa. I wish I could adjust volume without the phone, but that isn't a feature"], "(Renewed) Apple AirPods with Wireless Charging Case - White": ["They won’t connect at all. I reset them and everything. The airpods weren’t working at all. They deserve zero stars it’s a bunch of crap!!!", "The AirPods I got looked completely legitimate and it wasn’t a few days later when I tried to rested them did I get the sneaking suspicion something was off. After comparing them next to a buddy of mines’ actual AirPods it’s easy to tell the music quality is off. There’s also an additional Bluetooth connection noise, music sharing doesn't work, find my (device or whatever) dosent work, you can’t change the settings for the device name or what tapping the AirPods do, you can’t check the five info under Settings -> About, and the Bluetooth icons are what they are for normal Bluetooth connected headphones. The construction is worse too, it’s hard to notice though, but the bottoms where the contacts are comes off pretty easy and the internal netting where the speakers are moved with little effort. Lastly the serial number is fake. If you look it up you’ll notice other people have asked about it before. For future reference by anyone that runs into a similar issue, the serial is FWYSDH65A8GS on the inside left side of the AirPods case. Oh and the amber light doesn't come on when you try resetting the case.", "Super happy! Came in original box, a brand new unwrapped lighting cable, and the AirPods are clean and flawless. Looks like they cane straight from the apple store! Thanks.", "Brought it last week, but I didn't have the time to use it until yesterday and the left earpod is not working.", "Product works perfectly, once I figured out how to turn them on and to use them/ no instructions whatsoever come inside the Apple Box by the refurbisher. I would buy them again, for sure.", "Zero stars, I have to leave at least one. This supposedly “renewed by Amazon” product shipped without a factory reset and the right AirPod totally non functional despite both headphones being fully charged.", "Please believe what the other reviews have said.The LEFT side stopped working in less than a couple days old.Better to buy the non “refreshed” ones as there only a few dollars difference.", "It’s old and and bad  it’s use  bad", "We had an issue with this item not coming in when promised and it happened to be for a pretty big birthday gift...I called Amazon & it was made right so I will honor the good rating because I really like these headphones also! They stay in the ear easier than the smaller wireless pods.", "Thank you for my AirPods I love them good bass volume loud I have no problem with it thank you"], "Beats Studio Buds – True Wireless Noise Cancelling Earbuds – Compatible with Apple & Android, Built-in Microphone, IPX4 Rating, Sweat Resistant Earphones, Class 1 Bluetooth Headphones - Black": ["Whenever I see something with a 4-star review, it usually means it’s a solid product but there’s something (or somethings) keeping it out of 5-star range.For me, these are a perfect example of that. They’re small (good), not terribly obtrusive (only some out-of-ear-stick-out, tho your experience may vary), the sound has some solid bass which is helpful for the gym (where I tested these out), the sound overall is clear (download some equalizer apps to play with the sound itself), and they stayed in my ear well. I don’t know much about soundstage or whatever, but the sound itself is clear, bass is nice and strong, and you can hear even the subtle nuances like the shifting of a hand on guitar strings clearly enough without being disturbed. That, to me, is the sign of a good earbud.The transparency mode and noise canceling modes were alright. But that’s just it, they’re alright. Granted, the AirPod Pros have a higher price tag, so they do the ANC and Transparency mode much better. So it’s understandable that these would do the same, but on just the slightest bit of a lower level.I’m also spoiled bc the Airpod Pros have wireless charging. These DO have USB C, but the lack of wireless charging is a small thing, really. There’s something about being able to toss these on a charging pad and leaving them there to charge that’s just so satisfying. Also, was not a fan of how the case just doesn’t have that “premium” feel. The matte finish is nice, tho I would have liked a little more weight in the case lid, but at this point, these are such little (and I mean LITTLE) things that really, it’s not a dealbreaker.My only thing is the amount they stick out. I’m sorry, but they do look a little…funny, the way they sort of stick out just a bit so that the “b” logo is upright. They don’t stick out a LOT, but juuuuust enough that when you look in the mirror, you’ll see a vertical line where the physical button (which I have managed to press on accident a couple of times while adjusting the bud) sticks out. Also, I had a little difficulty getting them to stay in, but that’s beyond pretty much anyone’s control.These get that 4th star because of just how they are a solid enough product worth the purchase. They don’t do any one thing particularly well, but there are just enough teeny things for me that I wouldn’t say these are the best I’ve ever used. (For comparison, the Jabra 75t gets the equivalent of a 4.3 rating…the hear-through is amazing and their app really helps boost functionality).For me, these are SOLID gym earbuds. They play music loudly, clearly enough, and the bass is strong enough for me that I can drown out whatever annoying other music is playing outside. They fit and stay relatively well. For the price tag, you get some good bang for the buck. You could do worse, but at this range, depending on if you want to pitch in a few more, you could also do better.", "I love these! I have the AirPods 2 and AirPods Pro and these are way better! With the AirPods Pro the un ear fit was horrible these kept falling out which sucked! With these they fit perfect and don’t even feel like I have anything in my ear. I like that they don’t have a long stem popping out because If anybody is like me and has there earbuds on while putting on a sweater the AirPods fall off but these don’t get tugged on by the stem because they don’t have one! If anybody loves the bass in songs these are great! Absolutely love this product!", "I started off giving these earbuds 4 stars, and then realized that I was unfairly comparing them to Air Pod Pro's that are over $100 more expensive. For the relative value, these earbuds fit the bill.Feel: These earbuds are a bit slippery, and with the squat design it makes them a bit hard to grab. However, they fit snug into my ear so I don't have to over handle them much anyway. It takes getting used to putting them back into the case correctly.Looks: I like the variable colors. I bought these because I misplaced my tiny white Air Pods Pro case (whose last location deleted after 24 hours because Apple is a money monger). This red case is bigger but not cumbersome.Interaction: I don't like the button on the outsides of the buds. I wish the button was on the bottom with more of a squeeze function. To click the button, I have to essentially jam the bud further into my ear to get it to press. I also like to lay down with my buds in, but if I turn my ears against the pillow, the button is constantly pressing. A button positioned on the button (or top) would be way easier to pinch when on purpose without accidental clicks. At least clicking it doesn't pull the buds out of my ear; an issue I had with the lever arm of the APPs.Sound quality and connection: Good enough for me. Calls connected and sounded just fine. I don't need my phone calls to have live orchestra quality. The music seems good too. Not overly bass forward but crisp.ANC/Occlusion: The occlusion effect seems slightly worse than the Air Pod Pro's but no where near as bad as the Jabra's and other brands. I can sometimes hear my stomping on pavement but I don't hear my blood flow or anything. The ANC/transparency is also relatively equitable to the APPs, of course slightly not as significant in quality because these buds are much cheaper. It does seem to smartly block out certain sounds; i.e. my HVAC, while letting through someone calling my name.Haven't really tested the battery life but supposedly they're better than APP. Again, these are solid buds for the price. You get what you pay for, and these buds seems to prioritize what I actually care about so you don't have to pay $250 every time your APPs or Bose go missing.", "I’ve owned several AirPods and after losing a lot of them (because they fall off or because they’re just too small and are easily misplaced or left in a pocket and ran through the washer) and replacing them I Eventually purchased a pair of Powerbeats pro that I found for $149I’ve been thoroughly happy with them since my purchase 6 months ago. They solved a lot of issues that I had with the AirPods for example;They’re bulkier therefore more difficult to misplaceThey stay on my earAnd the battery life, whoaaa. Lasts all day.There was one flaw. I struggle answering calls frequently. I answer and there’s a long delay. 10 seconds or so. Enough To where the other person hangs up. About once a day. It’s very annoying.When I saw the announcement of these I was excited, I thought it was an improvement. And with the $149 price tag I thought it was a good deal. Let me explain why I returned them after two days.The battery life is worse than the original AirPods. Half the time the person on the other line cannot hear me. When I answer the phone call with my Apple Watch it does not come to my earbuds like it did with AirPods or Powerbeats pro, it goes to the watch which is annoying. Also, what’s the deal with ANC.  I held down the button like the manual says, and waited for a chime but then nothing really happened. I couldn’t tell if I was turning it on or off. It didn’t feel like it was working.I will however mention that I pre-ordered it as soon as it was announced so maybe I got a bad batch. The only positive thing about it is I really like the slimmer case compared to the Powerbeats pro and when I put on a new shirt the earbud stays in my ear unlike my Powerbeats pro for obvious reasons. I’m going back to the Powerbeats because I thoroughly enjoyed how long the battery life lasts and i don’t feel like it’s gonna fall out of my ear like the buds when I’m running aroundKeep in mind, I have never tried AirPods Pro. Maybe I should", "I really expected more out of these, Anker’s Soundcore Pro $99 earbuds sound better than these, this is very depressing considering how massive of a company Apple is. I haven’t used Beats since the Studio 2s, these are not the beats I remember. The sound is extremely flat. Depending on the genre you’re listening to that might change the bass is different on hip hop music. But I tested these for about 2 hours different genres: Dance, HipHop, Death Metal, Country, Classical & dubstep. Sure they’re loud but they sound distorted any volume above 80% you lose a bunch of audio quality and you hear these make crackling sounds like if they’re struggling to deliver the sound. I’m not sure why almost every earbud company struggles with loud volumes, I remember back when we used wired earbuds this was never an issue. You’d think after almost a decade of Bluetooth this wouldn’t be an issue anymore. I’m very disappointed I bet Dr Dre is swinging at the air using these. The case is extremely flimsy, if you even touch it it’s all smudged and look like they’re months old. Wtf Apple? These should be atleast $80 earbuds. The packaging is a failure too Apple really cheaped out on everything, it’s like they were on a rush to compete with Sony, Bose & other new earbuds. Go back to r&d Apple you have to realize not everyone likes flat sound. To everyone leaving positive reviews, it’s clear they don’t own any other earbuds besides AirPods, I’m not here to kiss Apples Butt, I’m a real consumer who cares about getting their moneys worth. The ANC is far from being affective at anything. The only noise it can cover is light background noise. These will definitely not silence a plane, car, traffic, kids playing. Come on Apple get it together..", "Just got ‘em. And several hours later… here’s my honest opinion. I’m totally satisfied with the design, size, fit, iPhone compatibility, charging case, price, range, etc. Can’t tell you much about their battery life yet. What I do wanna tell you about is the sound. I’ve tried a lot! of high-end headphones and earbuds over the years. Bose, Sennheiser, Sony, Apple, JBL… But these Beats Studio Buds blew my mind! Clarity within strong bass. True sound of live music. Unbelievable! You MUST check this out. Go to YouTube and search for “dolby atmos sound test”. Believe you me, it’s a game changer! These bad boys CAN pull it off, revealing their full potential! Amazing! PS usb-c to usb-c charging cable (included) is an idiotic idea! IMHO, usb-c to usb cord would be more suitable.Update: Two weeks later. Here's a few things I'm not happy about...Battery life. Honestly, I don’t think they can last up to 8 hrs. straight, as Beats claims (without putting ‘em occasionally into the charging case). Wearing ‘em “on and off”, the battery charge level drops rapidly within a couple of hours. (neither ANC nor Transparency mode activated) Hmm…Physical “click buttons” suck! Sticking ‘em into my ears (with my sausage fingers) can be quite challenging sometimes. I happen to press these buttons too many times and this is annoying as hell! Oh, well…Lack of volume control!!! That’s a big issue, I’ve experienced with New Beats Studio Buds, for sure! Every now and then, you may wanna adjust the volume… Nope, can’t do it! You must have your phone nearby.An instant pairing with iPhone works 6-7 times out of 10. Go figure, right!?In conclusion, I have to say I still like Beats. I’m gonna keep ‘em as a secondary pair. The sound is astonishing, no doubt about that! The price is right too. Would I recommend ‘em? I guess. But… (read above)", "I just received them today. Nice size for them, ear buds fit perfect in my ears. Sound quality is better then AirPods Pro in my opinion. Only downfall is you’re not able to be away from your phone. Meaning the Bluetooth connection is only a few feet away. From my room to the front door I’m having connection issues. I’m able to be at longer distance without my phone with the AirPods Pro than the Beats.", "I've tried a few different \"Premium\" earbuds recently and all have hurt my ears after an hour of use.  I've now been wearing these for the last 4 hours and my ears feel great!  The audio quality is nice, I also have not had any audio sync issues that plague these types of earbuds.  I will update more after a week or so of use, but the fact that my ears feel good, the audio sounds amazing and no other issues to speak of, winner winner!", "I really was looking forward to using this product, since I have a problem with my AirPods Pro coming out of my ears just enough to allow ambient noise to be heard as I work out.BUT, this product is not good at all!  The noice cancellation is mediocre at best.  They also tend to move out of my ears about as often as the AirPods Pro, but the real problem is that any adjustment will cause the button to be activated!  So, it will either stop playback or turn off noice cancellation.They also don't seem to have a large enough antenna to prevent Bluetooth signal drops.  They are being returned.", "So I’ve had my AirPods Pros for years, and the first day I got them, it came with all kinds of glitches like crackling and squeaking, and the AirPods pros kept slipping out of my ears consistently, and whenever I try to adjust my AirPods, they even slip out with little sleeves that you put on them and with other company ear tips I bought, and while I’m talking on the phone I end up accidentally hanging up on the person when I’m trying to adjust my AirPod So I figured I would give these a try and my gosh they sound so much better they fit in very securely, and the noise cancellation is fantastic so overall I would highly recommend them plus they’re very stylish, and the case is very nice, but one thing I would recommend is buying a charging cord because the one they give you is like 1.3 inches long which is tiny"], "(Renewed) Apple AirPods Pro": ["Headline says it all", "I was so excited to get these. While the sound quality / ANC is amazing, I have a consistent, irritating buzzing / static noise in the right Airpod. When you spend this kind of money on a product, you expect it to just WORK. I have troubleshooted online, reset the Airpods several times, etc... still has the buzzing static sound in the right pod. I regret making this purchase through Amazon.", "Mic doesn't work, loud clicking noises happen frequently, sometimes refuses to connect. Difficult to contact support. Took to an Apple store and they confirmed this was a fraudulent product. Do not buy! I am appalled that Amazon allows fraudulent products on their platform", "This product arrived LOOSE IN A BOX. The items left ear pod refuses to charge above 77 percent. The box flashes amber and WILL NOT PAIR as a set. When The right one is Individually  placed in box the right one will pair allow you to remove it from box and play music well. The left one when individually placed in box will pair and play in charging box, but refuses to remain connected once removed to use.  As a set these refuse to work at all. Performed reset options on Apple website, nothing works.  Product advertised as amazon tested and renewed.  Seller questions suggest having Apple fix them at a repair location. I find this a ridiculous request to customers, would not paid the price for broken Apple AirPod pro.  They do appear to be genuine Apple product. All S/N match. Processing return as I write this.", "I was a little mad about the price but I didn’t want to wait until next month until brand new AirPod pro’s were in stock, and these came in good condition too.", "These headphones are great mine came brand new", "I ordered these as a Christmas gift. It says renewed but it looks and sounds like brand new. Great sound. Great noise cancellation. These are with the wireless charging case.", "It was perfect band new !!! Good job will come back again .", "Bought these AirPod Pros from the seller recom. I checked the serial number through Apple and it was not a real number. They are counterfeit fake AirPods I do not recommend them. If you want to buy fake do not pay $200 for them. Check online there are many ways to tell if they are genuine AirPods or counterfeit save yourself the money.", "I hesitated buying these because they were renewed but i 100% recommend if you were hesitant because they are brand new and work perfectly. The only flaw was that the box was a little dirty from the previous owner and the airpod case was a little scratched up but airpod cases in general scratch super easily but other than that the AirPods themselves were perfect"], "JBL Tune 125TWS True Wireless In-Ear Headphones - JBL Pure Bass Sound, 32H Battery, Bluetooth, Fast Pair, Comfortable, Wireless Calls, Music, Native Voice Assistant (Pink)": ["While there is a lot of good things about these headphones, there are some problems that can overshadow the areas in where they shine.They sound really nice, but I changed the included tips with some larger foam ones for a better fit to get the best sound.  Unlike some other headphone models, the buds still fit in the case with the larger tips.  Big plus in my book.They are comfortable to wear, and they don’t stick out from my head enough to bother me even if I’m laying on my side with my ear on the pillow.  They fit snugly and don’t feel like they’re going to fall out easily.In my opinion, the sound quality outperforms the Apple earbuds, but that can be subjective.The isn’t much sound isolation in these, even with properly fitting foam tips.  They don’t block out much ambient sound, so you can easily have a conversation with someone, but it also means that you would have to turn the volume up in a noisy environment- and it also means that others can hear what you’re playing.  This can be good or bad, based on you preferences.I really like that the controls are clickable buttons.  I like this interface a lot better than the “tap” or “squeeze” control method, and it’s worlds better than buds that use a capacitive touch control that gets triggered every time that you try to adjust the fit.Now, to the problems.The pairing isn’t straightforward. I tried to pair with my Android phone first, following the included quick guide.  My phone detected the device and prompted me for a PIN to connect, which was not written anywhere in the guide.  I tried the suggested “0000” and “1234”, but neither worked.  I tried to Google the PIN, and found the documentation for the earlier model, which said to remove the right earbud from the case to pair.  When I tried that, a second JBL headphone profile showed up in my Bluetooth list and I was able to pair without a PIN.I’ve since paired it to an iPhone and an iPad without problem as long as the right earbud is out of the case.The latency is pretty bad with these, much worse than any other true wireless earbuds that I’ve ever tried- and I’ve tried a lot of different pairs.  The latency can be different each time that you connect them, and they seem to stick to one of two latency values, either around 150ms or 500ms.  There are some videos that you can use to test your latency (lag) and these can be really bad.  I noticed it immediately when watching a movie, and even 150ms is enough to notice that the sound is out of sync with the video.  If it’s in the 500ms (1/2 second) mode, it makes watching a video very irritating.  I’m currently wearing these while typing this review, and the delay for the keyboard clicks is very distinctive.I’ve also noticed an issue when using it with my Android (OnePlus 8 5G) phone where it will occasionally have a bad connection.  It will play for a second, then mute for a second, repeating until I put them back in the case and pull them out again.  This happens about 20% of the times that I connect to them.  This does not happen with any other Bluetooth earbuds that I have, so I’m sure that it’s an issue with the JBL buds.I also get a random connect/disconnect chime while using them.  I’m not sure what triggers it, as the audio doesn’t pause or drop when this happens.In order to switch from one device to another, you have to manually disconnect them from the first device if it’s in range.During phone calls, the people that I talk to say that there’s some echo and can be a little noisy, even if I’m in a completely quiet environment.I was hoping that there might be a firmware update to address some of these issues, but the JBL app doesn’t support this model yet.These sound pretty amazing, but unless there is a firmware update that can resolve the latency, Bluetooth dropouts, and random chimes, I can’t really recommend them.  If you’re only interested in listening to music, they would be great.  If there is a firmware update that fixes these, I’ll update this review.", "JBL Tune 125TWS - True Wireless In-Ear Headphone – BlackI’ve tested some off brand ear buds recently and for their price point I had to be satisfied but I felt like I was stretching. Now for a little more money and JBL as the brand we are into earphones I have little to no reservations about. I also own AirPods Pro and do like those more because, mostly, for their active noise canceling. These JBL Tunes are uncomfortably close in sonic quality to those. They blow away any of the thirty five dollar level players. I’ll go over some of my reasoning to be able to say I recommend these and feel if you don’t need ANC you will enjoy these and not break the bank but maybe stretch a little more than you wanted to but will be glad you did.First up is how easy it connected to my iPhone. I first topped up the batteries to get ready to test them. They were pretty full and topped off in less than half an hour. I put my iPhone in Bluetooth mode and opened and removed the buds. Almost immediately the JBL model number appeared and I tapped it. Connected. It acknowledges the connection with a sound, there’s no small person trapped in the buds.I placed them in my ears following the guide, the guide is awful and really needs to be redone. I mean white text on a yellow background? It uses multiple colors on different pages for style I guess. How about just make it legible. So now they’re in my ears and are reasonably secure and comfortable. The first thing I did was play music and I chose a Shaggy tune to test the bass this was claiming to have. Well strike me down it has bass! I mean they are thumping in my ears. I have my iPhone EQ set to flat but tested other modes and could adjust how it delivered the sound. I continued playing a set of songs I like to hear some Rock, Pop and vocals. I was very happy with what I was hearing. In playing with the songs I also tested the controls on the outside of the buds. I like these more than many I’ve used and dare I say my AirPod Pros? You press in and get a click. It was easy, I didn’t have a miss-step, they just worked and did what I expected them to do. I was able to adjust volume from my Apple Watch as there’s no direct control, Apple is the same on their pods? Why isn’t volume a thing anymore on buds? I was impressed with my ability to get all the commands, including summoning Siri so easily.My next test was a phone call to a friend and he was impressed with my voice’s sound and I heard his voice clearly and undistorted. I’d did a great job and these are designed to work with both buds in or either one alone. If you want to have an open ear and listen to something or make a call, you can.I’m impressed with these JBL earbuds and find them at a very reasonable price point for the level of the sound and ease of use. The case is also a battery so you can recharge the buds on the go and a USB C cable and alternate silicones are included as expected. I can easily recommend these as way above average earphones and they sound really great and are a bargain for the cost.", "Does anyone out there desire a bit mkre volume or am I going deaf fast??? Sound quality is phenomenal as always with JBL products. Tbe comfort fit is great!! I just feel every so often I could use a bit more volume. Please, someone tell me I'm not nuts!! Or deaf!!! Lolol. Overall..... Good job once again JBL!!!!", "Was so excited to get these. Decided to spend a bit more than my $35 BEBEN earbuds. Not impressed with the sound at all. Bass is good but that’s it. Mids and highs are terrible. My cheap earbuds sound much better. The JBL’s also are really big. Not heavy, just big.  Was pretty bummed out. Guess I have to get something In the $150 plus range for a real upgrade. The search continues...", "I own a pair of Apple Airpods and recently tested a pair of Jabra Elite Active 75t True Wireless Earbuds.  It probably isn't fair that I moved on to these JBL Tune 125TWS True Wireless In-Ear Headphones next.  They are in a completely different price range, and a different category for quality, as well.  So I will certainly keep this in mind as I write this review, even if I do make occasional comparisons.  If you aren't interested in reading the details, the short version is that these are very good earbuds for their price, sound quality and features.  Read on for the longer version, which is the same, but with relevant details.These JBL earbuds come well-packaged in fully recyclable materials.  Mine arrived already charged, and set up is super simple and intuitive.  I put a bud in my ear and held the outer button for a long beat and almost immediately heard a zippy sound that told me they were instantly on and automatically pairing!  (It is actually a sound that announces that they are ready, not a weird humanoid voice, thankfully.)  I didn't even have to connect them through my iPhone, though the display came up to show me that they were paired.  I love that there was no hesitation or any steps needed on my part!  So simple!These earbuds come with a charging case, of course, as well as the charging cable, plus some extra eartips so you can find the most secure and comfortable fit.  The buds were very comfortable for me as they were, so I haven't needed the other tips.  There are three illuminated dots on the case to indicate how full their charge is and to let you know when they are done charging.  The case is much larger than my Airpods case (see photo for size comparison) and larger than the Jabra case, too.  I have only made a couple of calls with them, but these are excellent for phone calling!  The sound is very clear and I've heard no complaints from people on the other end.  They seem to hear me clearly, too.  I also love that you can use these to communicate with your favorite virtual assistant.  \"Hey, Siri, what's Billie Eilish's full name?\"  \"Billie Eilish Pirate Baird O'Connell is Billie Eilish's birth name.\"  That's really convenient when you're out and about and need to know things!  Now for the unfavorable and probably unfair comparisons.  These earbuds don't sound as good as my Airpods or the Jabra earbuds.  Of course, they cost less than half of those higher quality buds.  But within their own price range, they are very, very good!  The sound quality is crisp and clear, but disappointingly small.  There is some decent bass sound, but it's not amazing.  Operation is super simple, using one or two clicks to skip forward or backward on the left bud, and pause or play on the right.  You can also use one bud at a time, left OR right, which I find helpful for phone calls.  I especially appreciate that feature because these earbuds don't have a transparent or hearthrough mode, but in mono mode (one earbud) I can listen to music and still hear what's going on around me, which makes me feel safer in certain situations.  One great feature that makes these stand out from other similar devices in their price range is battery life.  These JBLs boast 8 hours of playtime in the earbuds themselves, plus 24 in the case, so I have only had to charge them two or three times a week.  Of course, YMMV depending on your usage, but the battery life has been fantastic for me.Overall, I think these Tune 125TWS earbuds are a very respectable offering from JBL at this price point.  Since I own other earbuds whose sound quality I prefer, I won't use these as my favorite buds for listening to music.  I will, however, keep them in my car or in my office as a back-up pair and for phone calls.  And since the fit is so good, they might be perfect for working out, too, with easy operation and no fear of losing them.", "I wanted to find a pair that was up to par of a previous earbud pair i had once owned. As far as sound quality 5 stars. The carry case and overall ease of getting everything connected is very simple. Battery life is good. My only issue with these and why i do not recommend them is because of the fitment and ability to stay snug in your ear. Any type of movement and you can feel the earbuds slowly start to slip out. The silicone ear insert pieces supplied are very thin and weak especially once wet. I wouldnt recommend these for any type of working out or physical activities.", "The size is perfect! It's not to thick wide or bulky, and goes in real snug in my pocket. Also, the sound quality is nice as well. I also love how the design makes the earpieces got in the ear canal directly, this makes me a person with a slightly deformed right ear real happy, there are not many earpieces that allow me to use both sides and enjoy the sounds so this a huge one for me. Also the sound quality and bass are nice as well!", "I purchased a pair a month ago, and immediately had to exchange them. They would not pair with any device and were defective. I was happy when I received a replacement because they paired immediately with my computer and phone easily. Now, less than a month later, I am returning my SECOND pair (this time for a refund in order to get a different brand/model) because the left earbud stopped working. I have charged it, I have turned it completely off and turned it back on and there is no sound. It was working and then in the middle of a meeting, just stopped. The button to control the tracks on my device still work, so it's got power. I have no idea why the speaker stopped working. I am beyond frustrated. (No, I haven't dropped them, spilled anything on them, etc. I just take them out of the case and put them in, then return to the case.)The microphone quality is also absolutely horrible. I have to use the computer's built-in mic for work video conferencing because no one could understand me with the built in mic on these. It is annoying to have to switch settings every time I get into a virtual meeting but I was OK doing it because these were a good mid-point price... but now I know it's totally not worth it. Skip these and go buy something else. I'm not giving them a third chance.", "Great for the price!Feels high quality, amazing sound, and incredibly comfortable for only 60 bucks. Definitely can be compared to the airpods but much cheaper of course. Much rather pay 60 for trusty JBL, than $200 for show off Apple. Definitely recommend. Especially as a gift!"], "Apple AirPods Max - Sky Blue": ["First off, out of the box these are the most extraordinary headphones I’ve over owned.  The deep rumbling bass, clear mid and high range and the noise cancelling!  Wow, it’s almost disorienting it’s so good!  So, why the two stars?  Three days after opening, I’m on a cross country flight when a popping, static sound begins filling the right ear cup.  To the point where I had to take them off.  I went to an Apple Store, where they explained I was out of luck with them and had to return them some other way.  On top of the popping/static, they have stopped automatically pairing to my iPhone and ipad, requiring me to reset the headphones each time.  Thankfully, Amazon has a longer return period for these.  I will be ordering another pair and hoping for a better result.  For nearly $600, i expect more from the product and from Apple support.  I will update this review once this has been completed.", "Holy shift, these headphones blow everything else away, IMHO. Of all the \"high end\" headphones I have owned over the past many years (60, to be exact, since I received my first pair of headphones when I was 16), these are the absolute best! Sound quality, comfort of fit and wearing for an extended time, build quality, it just doesn't get any better. As an Apple fanboy since my first Apple computer, a model IIe, I have owned nearly every Apple product and I have never, ever (well, almost never ever) been disappointed. These AirPods Max indeed are the \"max\", the ultimate listening experience. Grab them and you will have done yourself a HUGE solid. Trust me on this, I would not mislead you. However, if you are an APPLE-hater, then please refrain from expressing your vitriol since I am only a lowly consumer.Btw, I have not been paid by APPLE to write this review nor am I or any of my family employed by or connected to APPLE in any manner (although I wish I was). Thanks for reading this and I hope it helps you to make the right decision: buy these headphones since you know that you really do want them!", "Best sound quality, but worse quality overall.they keep falling over, they squeeze too tight, they're too heavy, you cannot walk too fast while wearing them.these are the worse headphones i've ever owned. I gave my girlfriend my bose qc2 and now im bitter. i now have to buy a brand new pair of bose headphones because these are so god awful.apple, why on earth did you make headphones that weigh so much? how do these headphones have such high reviews? this is weird.there's no way people truly believe in these headphones. they're over priced garbage. Wearing a mental headphones on my head gave me head and neck ache.just to be clear, i have a macbook, apple watch, mac mini, iphone, airpod, airpod pro, and even an ipad. This is by far the worse product apple has ever made. i'm shook.If you want to wear weight on your head, buy these.", "After a replacement and a couple months, I have to edit my review.This item will break for no reason no matter how careful you are long before the product's expected lifetime has elapsed. Reduced initial review from 5 stars to 2 stars for expected product lifetime of 100 - 500 hours.Ask yourself, would you rent headphones for $1 per hour?If so, then these are for you.", "I had the Bose QC35s and the Bose 700 as well as the AirPods Max. Between the 700 and the AirPods max the AirPods are way more comfortable.Against the Bose QC35 it’s more of a tossup based on what you prefer. The QC35s are much lighter on your head, but have more pressure on the headband. The AirPods are much roomier in the ear cushion but the clamping force is much higher.That being said, the premium and luxury feel of the AirPods max is insane and blows anything else I’ve felt out of the water. I don’t really think it’s worth the up charge but it’s pretty nice haha", "I loved the sound, hated the weight (almost 1lb). I loved the quality, hated the condensation that built up inside the ear cups after wearing them for over an hour immobile on the couch or at a desk. I also didn’t like that the two ear cups didn’t clicked against each other. In addition to that I didn’t care for the “smart case.” I’d go to sleep with them fully charged and I’d wake up to them with 1% battery. I personally think the AirPods Pro sound better especially with with spatial Audio... I also don’t feel like airpods max have the best noise cancellation the AirPods Pro’s is better to me. The last reason it I have 3 stars is because they don’t have a power button !", "When the AirPods Max were introduced in December I waited a few weeks to order them feeling that at $550 they could not be worth the price.  I was wrong.  I have several sets of headphones and the AirPods Max are quite clearly the best in every way -- quality of sound, comfort, ease of use, and overall convenience. I have enjoyed listening to my music more since receiving these headphones than I have in a very long time.  Battery life is excellent easily matching Apple 20 hours. although I have not traveled on an airplane since receiving the AirPods Max, the quality of the noise cancelling is incredible and the transparent mode works so seamlessly and well that one is easily able to hear and understand others when in this mode. Most important to me is the comfort of a set of headphones. Apples mesh design does a great job of spreading the weight of these headphone across a broad area on top of the head.  I have worn them for hours without my ears getting hot or discomfort. In summary, I love the AirPods Max and feel they are worth every cent of the price.", "The headphones are overpriced at $550 . The noise cancellation works excellent , and sound qaulity  is good too . Cant wear for long period of time as it weighs around 3.86 lbs. My head started hurting after 10 min of listening . I don't recommend this product. Better go with airpods pro .", "I was pretty excited when apple decided to come out with these but they left me disappointed enough that I returned them.For startes, the cloth is not comfortable.  Having had incredibly comfortable quiet cloth it's what I expect for a premium set of cans.The noise cancelling is rated quite well but because of the design and padding if you turn your head, gaps form which destroys the noise cancelling.Thirdly these are HEAVY for headphones.  The padding does a surprisingly good job helping but the fact is they are needlessly heavy.  Having them this heavy both creates strain on the user, and makes it so they don't track head movements well unless exaggeratedly slow.The benefits are the same you'll get from other apple products (within their ecosystem), with the exception that the sound is clearly superior to AirPods which they frankly have to be.The battery life for it's class is meh.", "So I thought that the AirPod Pros were the way, don't get me wrong, they are.  Different purposes for different devices and functions.  I described the quality of the sound to my radio DJ buddy, who is a sound fanatic, only after trying them on in the Apple store for like 10 minutes and playing around with them, but did not buy them.  Off that description alone, he purchased them that evening while we talking.  After they arrived to his house, he placed them on his head and never took them off he said.  He not only forced me to buy them, saying it was the best thing he has ever had on his head, that says a lot from a man in the radio business for the last 33+ years who has used everything on his head as you can imagine.Once they arrived at my house, I have not taken them off either.  Phones calls, music, and the movies!  OMG!  Movies are unbelievable. You can hear everything, every small sounds, and if you are watching anything with Dolby Atmos surround sound, watch out.  You will looking over your shoulder wondering where that sound is coming from!  Movie watching late into the evening with the family in bad takes on a whole new aspect.  No longer do it \"need to turn it down\" so people can sleep.  I can make myself go deaf if I pushed it.The feel is solid.  I had to get used to the weight, but I have not worn over the ear headphones in decades.  Battery life is amazing as well, I can use it all day while working, listen to music, taking calls for hours, etc... and still watch movies most of the even and have not come close to draining the battery in a day.  It also charges up very quickly to my surprise.I have been using these daily since Father's Day, my gift to me.  Make this gift to your self if you are on the phone, love music and love cranking movies late at night when people are sleeping.  It was the best decision / purchase I have made in years!"], "Apple AirPods Max - Space Gray (Renewed)": ["Horrible product & company to do business with! They are selling CRAP products and not responding when their crap products don’t do as they’re supposed to. How are these even Apple headphones? I spent $600 on headphones - I have a 2020 iPad Pro a 2020 , 2020 iMac ,iPhone 12 max pro and an Apple Watch 5 cellular plus Wi-Fi - yet these do not connect or stay connected to any of my devices. I have to hard reset these 5 to 10 times per day! Literately! Literally! One more time, literally!. I am literally ready to cry, I saved up for months to get these headphones , I was left with useless crap. Please respond customer service I am trying to reach you!", "First of all, I bought these refurbished so not sure if some of these issues are because of that or not.But…I have a love/hate relationship with these headphones. First, the good:The sound on the AirPods max is phenomenal. The noise cancellation is top notch. My favorite feature though has to be the transparency mode. It uses external mics to pick up sound around me so if I want to listen for the kids or something for a few min, I can turn that mode on and not feel like I’m completely tuned out.The headphones are a little heavier than others but despite that, they are pretty comfortable to wear all day during work.The Bad:I am not sure what the deal is, but the automatic switching between multiple devices is extremely annoying. I would be on a zoom call and just look at my phone and all of a sudden my audio would cut out and try to switch to my phone audio. I’m not sure this has so much trouble because my old airpods never seemed to do that. Thankfully, I found the setting to manually connect when using the device which they have worked a lot better since then.The other thing that’s a bit annoying is the “smart” case. They are just really cumbersome and not as elegant as I would expect apple to be.All-in-all, I do like these headphones - I just need to get used to some of the quirks.", "If you purchase amazon renewed products then you're smarter than the average bear. Every amazon renewed product I have bought both looks brand new and saves me tons of money, and if you have the prime credit card that gets you rewards you cans save even more money. I bought these for like $430 vs. $550 from apple or other retailers and then had $200 in rewards so with taxes I paid like $260 bucks for these headphones and they look amazing. Whether you think apple is overrated or overpriced is subjective but as far as what you're getting from amazon they're in great shape, original packaging, and lower priced.", "I purchased these AirPods Max from Amazon Renewed. I’ve had problems with refurbished items before but I thought that since this is Amazon I could trust that they would do their due diligence and make sure the product worked properly before listing it for sale. I was wrong. The product arrived and does not connect via Bluetooth to my phone whatsoever. I tried repairing several times as well as restarting my phone and resetting the headphones themselves. All attempts failed. Amazon sent this package with a sticker saying “Thanks to you, this product has a second life.” It doesn’t deserve one and clearly Amazon does not bother checking and they do not fulfill what they promise in their refurbished guarantee, which at the very least, is a working product.", "Bought these Amazon renewed. These are freaking awesome. Mind blowing soundsDefinitely worth it. Expensive but worth every dollar. You’ll agree once you slip a pair on. Definitely recommend theee.", "I returned these after only 4 days of use. I think they’re lovely headphones for other people, but they’re not for me.(1) They’re very heavy. I bought these to wear all day while working remotely, and even after a few minutes of wearing them, I’d get a headache.(2) In order to get them to work properly with Zoom, I had to configure them as a “headset”, not “headphones”, which made the audio quality horrible.(3) I discovered the noise cancelling feature is too “strong” for me. It is FANTASTIC at cancelling noise, but it made my ears hurt after an hour of use. I’m used to my Bose noise cancelling headphones, and they don’t have this issue.All in all, I think they’re great headphones… for someone else.They just don’t work for me, and that’s too bad.", "Sounds like the way it was originally recorded so it might be able to be heavy on the bass but only if you use Customer set up.  These sound so good that I am able to hear new details to music I have listened to for years.  If you love HiFi then these are for you.  Also the headphone function works really well on this unit.", "I like that these headphones so conveniently connect to EVERY Apple device in my Apple's ecosystem. That price, mmmm, that's another thing. I would suggest that you find these somewhere at a discounted price. At the price point their offered it's too much.", "For the amount they cost I’m not impressed. Battery life isn’t that great and the noise canceling isn’t as good as the the air pod pros. The sound quality isn’t 500 dollars either, my 100 dollar skull candies sound just as good and are much lighter.", "I wasn’t sure to purchase a refurbish Apple product but these are amazing. They came in the original box and original documents. Fantastic"], "TOZO T6 True Wireless Earbuds Bluetooth Headphones Touch Control with Wireless Charging Case IPX8 Waterproof Stereo Earphones in-Ear Built-in Mic Headset Premium Deep Bass for Sport Rose Gold": ["These headphones are literally fantastic. I am a professional musician by trade and these have incredibly clear sound quality, really high end parts put into this product.The connection is fast and easy, it charges while in the case which is a great feature but better than all these features I love the ability to wear them in the shower and jam to tunes while they get soaked and survive it like a champ. Really high end headphones for a amazingly good price. I would recommend these to anyone looking for Bluetooth headsets similar to those made by Apple but for a far less price and also BETTER bass response!!The touch controls on the side are fantastically good if you wanted to pause music or youtube at work when someone asks you a question so you can hear them without taking the headset out. They are incredibly good at isolating and even at the lowest volume they can shut out the world around you. I wear them everywhere and love them so much.They come with a charge case, 3 extra sets of ear tips to fit whatever size ear you have, a charge cable for charging the case (micro usb) and a one year warrantee!Do yourself a favor and get a set of these superb Bluetooth earbuds!Did I mention they are waterproof?! IPX8 Waterproof!!", "This is the second time I reviewed this company's products. I'm sort of a earbud Junkie, and make a lot of purchases. About six months ago I purchased the older version of these headphones, and fell in love. I was looking on Amazon to see what other products this company had, and if there was any new versions. I was pleasantly surprised to see be upgraded version of headphones so I found a reason to order the newest set by giving my children my old set. I work in construction and listen to audio books all day long keep from going crazy , my job is incredibly boring. Because my job keeps me from home for such a longperiod. I only use one earbud at a time. I insert the first one around 3 a.m. and begin my stories, I swap it out around lunch and the second one last me until 4:30 in the afternoon when I get home. In the past with other brands I've had I'd have to swap out my earbuds about every 2 hours, not with these. The newest version that I'm reviewing is even better than the last, both in battery power, insound, an ability to connect to my phone. One problem that I've noticed I've had in the past with the charging boxes is that the magnets are almost never strong enough to keep the earbud from falling off while charging, this newest version has an incredibly strong making. It doesn't help that I have fat fingers then make it difficult for me to grasp small things. Hahaha, they did a great job we're including super strong magnets they will ensure that these earbuds keep charging for the next use. I threw my phone in one of my back pockets of my pants and this new version ensures you don't lose connection no matter which way you turn your head. They're incredibly loud and clear so that when you're in a noisy environment you can still hear what you're listening to. It took me a moment to get use to the fact that the buttons are touch activated rather than traditional buttons, but I quickly became acustomed to brushing the face of the earphone. Its nice as now when I set them in my ear I dont knock them out when trying to pause my audiobooks when people are trying to talk to me. In my last review of this company's products I said they have a customer for life, and I gladly say it again.", "Update: After about a year of use, we ran into some trouble with these headphones. They are constantly disconnecting from bluetooth and one of the earbuds is super quiet. I messaged Tozo to inquire about the warranty, and they are sending a full replacement. Two thumbs up for their customer service!I have a young teenage son who wanted a pair of AirPods, as he was sick of headphones with wires. I was unwilling to get him something so expensive, so we compromised with these, as it won’t be as big of a deal if he loses them!I already own and love a pair of Tozo T-10s, but he wanted a pair with a much smaller case that will fit in his pocket at school. These fit the bill! They’re about 1/4 inch wider and just slightly taller than airpods. He’s super happy with the size.The lid is magnetic and closes with an audible clack just like AirPods. Apparently my teen thinks this is important, ha ha.Charging via a charging pad works great. My son really likes the four bright lights that tell him how much charge is left. He says he’s used them all week and hasn’t had to recharge his case yet.The sound seems good. My son has no complaints whatsoever. I borrowed them for a few hours to listen to podcasts, and the sound was good for that.One thing that I wish was like the T-10 is that it does not appear that you can pair one earbud to one device, and the other earbud to another device.  My phone just recognizes these as Tozo-T6. The T-10s show as Tozo-T10-R (or L), which allows me to pair them as two separate devices. I wish this had that. But my son could care less, as he doesn’t own more than one device. :)Overall, my son loves these and is totally happy to have these and not AirPods. The model number suggests that maybe it’s a lower mode number than the T-10, but I think these actually might be a newer, upgraded version.", "Purchased in Jan 2020.  Originally I thought the earbuds were OK, nothing spectacular, but not horrible either.  I struggled with getting the earbuds in and out of the case (my fingers are blocked by case cover and if they were wet at all, I couldn't grip the earbuds to break the magnetic bond) and with bumping the earbuds and having the tracks start and stop.  The second item is something that shouldn't be surprising with the touch control availabilty.In teh box there was a sign up to get a free item, I signed up for a free case...it never came.  So why the 1 star, for nearly 2 weeks I was bombarded with emails from them offering me things to change my review.  Considering they never sent me the case, I didn't trust them.  When I responded no interest to changing review, the emails kept coming but in greater frequency.  So they got what they wanted, I changed my rating...just not t he direction they were hoping.End of story, the earbuds are OK, there are better options, but they aren't a trainwreck.  The company,  no interest to ever purchase anything from them again.", "Looking for a cheap alternative to Airpods, bought these based on numerous positive reviews.  Worked great for about 2 weeks, then the left earbud started cutting in and out during my runs.  Always and only during exercise.  I contacted the company and the response was that this was a known issue with iOS, and the solution is to download an app onto an Android device and update the firmware in the earbuds.  I don't have an Android device!If you have an Android device you might want to take a chance on these.  When they worked, the comfort, sound quality and noise isolation were good for the price.  I was very happy for like two weeks.  I have since returned these and shelled out for Airpods, and those are WAY better.  As they should be, given the price.", "So I have been looking for headphones similar to airpods in quality and feel for a while. I have tried many different headphones sold on Amazon, but either they are too big or they are too poor in sound quality.This is first headphone which has very good mic and provides very good sound quality even in noise environments, yes - I tried this at times square, absolutely no static and still other person can hear me. The sound quality is also fabulous. However what I love best about this one is its size, look and feel. Checkout the picture comparison with Airpods.One more important thing to me was battery life. I was really happy to see this one did better than airpods on battery life. Airpods discharge fast even if they are disconnected from phone, I believe they are constantly searching for phone around, but this one did not discharge even after 5 days. I could easily connect it to iPhone and use it.Overall I would recommend this as an excellent buy. I am planning to buy a few more for gifts, hopefully they will have some deal around thanksgiving.", "I waited a month to submit a review because I wanted to form a a well informed opinion before posting.PROS:The form factor is amazing. The buds and car easily slip into your pocket and can be taken anywhere. They fit my ears great. I wouldn't even know they were there if they weren't playingmusic.When they work the sound quality is great. I would compare it to any high end headphone/earbud. Absolutely no complaints.The controls are easy to use. Just tap.The nose cancelling is wonderful. I wear the buds while woodworking. My tools are extremely noisy. I can barely hear my tools.CONS:Wireless charging works, but the charger gets really hot. After wirelessly charging one time, I swore I'd only use a wired charger.The Bluetooth function is the real reason for the 1 star review. It connects and maintains a stable connection. The issue is that it the buds will connect to my phone when they are in the charger  They are not supposed to do this. The case charges the buds. Maintaining a constant connection drains the battery while they are being charged rendering the buds dead before I can use them. They are useless in this condition.", "After researching and reading dozens of review and answered questions on various brands for bluetooth earbuds, I finally decided to go with the TOZO T6 True Wireless Stereo Headphones which falls under 50$ budget.The main point which kept me dragging towards the TOZO T6 was its battery life. Of the available bluetooth earbuds in the market, TOZO T6 breaks the limit by providing around 5 - 6 hrs of battery life when used nonstop (Around 60 - 70% of volume). Either its working out in Gym or biking this earbuds provided great sound quality. As most people complimented on the sound quality, I felt the sound quality is amazing with powerful bass and stereo like sound.The battery case is so compact and thin that you could carry it in your pocket and it doesn’t bulk out much compared to other brands in the same price range. The connectivity between the headphones is so fast, as soon as you remove them from case they pair themselves and pairs to the phone right away (considering your phone’s bluetooth is on and you already paired them for first time) The touch pad on the earbuds are so reactive and responsive.By Far, I’m so much impressed with the earbuds. It fits perfectly into my ears, no complaints. I been using it for Gym and running and they fit perfectly in ear and don’t fall off. Please note that by default the earbuds comes with medium earplugs. For my ear size i replaced the smaller size earplugs and works like a charm. I will be using them for a while now and keep updating the review when ever needed. For the money, battery life, sound quality i would definitely recommend them.", "The first set I bought was the pretty pink set and I loved them- however after three weeks they stopped charging. My original review reflected that. I was contacted my the seller a few months later and they offered to send me a replacement. I recieved it quickly and the new set (black) has not given me any issues. Which is why I changed my star rating from 1 to 3.The product itself is a solid product, and it was very generous of the seller to send a replacement. HOWEVER- in EVERY email that I received from the seller(LIKE ONE A DAY FOR A SOLID WEEK), it was overly stressed (ie GREEN HIGHLIGHTING) that they wanted me to change my online review BEFORE receiving a replacement, BEFORE knowing if their replacement would even work... it was very obvious that they REALLY only care about their reviews, and not about the quality or satisfaction of their customers. So as far as the product goes- 4 stars, easy. As long as you don't get a defective product, these work great! But their incredibly pushy and image-hungry customer service- 2 stars. If you want to make something right, by all means do. But don't offer to correct your problems and then demand recognition for it afterwards. I would not purchase from this company again."], "Wireless Earbuds Bluetooth 5.0 Headphones Automatic Noise Reduction in-Ear Airbuds [with Airpod Silicone Protective case] Built-in Binaural Mic Earphones for iPhone/Android": ["I usually use wired headphones. But I always want to buy a good pair of wireless earbuds, so when I exercise, those annoying cables always interrupt me. So when I look at these,I bought it immediately. After receiving it, I immediately used them. . Comfortable and light. The sound quality is very clear. I use them for about three hours. Therefore, the full usage of the battery and the call effect have not been tested. But I feel they will not let me down. Overall, I am very satisfied with them!", "I love these, they're great. I've been looking for a pair of Apple Air Pods for a while, but just couldn't bring myself to spend $130-160 on them. These are the best Bluetooth earbuds I've ever bought. The sound is what I would expect at this price point, it's clean and the noise cancellation is great. I am very happy with the quality of it.", "I am satisfied with my purchase. Quick connection with my mobile phone, comfortable and good sound quality. I highly recommend them.", "Always want to get an Apple Bluetooth earbuds, but the original one is a bit over priced. So give this one a try and I’m pretty happy with it. Clean and easy design, sounds great as well, will see how long it goes, hopefully it can last longer."], "Wireless Earbuds, Bluetooth Earbuds Deep Bass Hi-Fi Stereo 35H Cycle Playtime in-Ear Wireless Headphones Sweatproof Earphones Sport Headsets Built-in Mic for Workout/Driving/Home Office": ["Wow! As someone that owns 3 pairs of AirPods, yes THREE pairs. Which went down to two thanks to my new puppy. Well, I knew I couldn’t keep wearing AirPods to sleep, so I had to find an alternative.I stumbled upon these on Amazon, and after reading the reviews I said what the heck, I can always return them. Well, upon receiving them I was struck by how well packaged they were, and then after taking them out and holding them they felt lighter. But not in a cheap way. I was also struck by their sleak design, and how they didn’t feel cheap or like a knockoff. I popped them in and they felt comfortable. Lighter in my ears, and turned on a playlist, and was blown away by the sound quality! They also weren’t even turned up all the way! I took my dogs for a walk, and rocked out! Calls came in and sound quality seemed better, and my partner said I sounded crisper. That’s the best way to describe their sound, “It’s more crisp, and clear.”Having said that one of the other great features that these BT earbuds is the battery power! I went several days of using them without having to charge the case. They charge quickly, as well.I have to say for an item that is as inexpensive as these, and as sturdy and well-designed as these have become my primary BT EarPods. I highly recommend these as someone that uses AirPods for work and for music to be purchased if you’re looking for an secondary pair of BT earbuds. Or just a gift for someone who wants a more expensive pair. I already plan to get these for my two young sisters, my mom and several others who won’t spend the money on official AirPods.", "The battery life is very good. I listened to about 6 hours straight of podcasts and had a phone call with a friend for about an hour before they ran low on battery. I usually use earbuds to listen to podcasts for hours when I'm working and they're excellent. They feel very high-quality. The lid magnet snaps satisfyingly and it feels secure. I don't have a case for it yet, so I've been sticking it in my pockets. The buttons are easy to use. There's no chance of accidentally tapping and pausing when you touch your ears. It takes a little while to figure out how long to hold the buttons to skip to the next song, but it's better than doing it by accident every time you try to adjust them.Update: since buying these they have become my new favorite wireless earbuds. They're convenient and reliable and easy to use.Update 2 (May 15, 2021): Unfortunately, I have loved these earbuds to death. I suppose months of heavy use would eventually kill them. One earbud still works as usual, but the other one has, quite literally, fallen apart. The small internal plastic pins connecting the back cover to the earbud body have snapped.", "I originally gave a good review of these earbuds, but now, less than two months of using them for one half hour per day, they have stopped working.  I contacted the company.  They gave me instructions for fixing them.  I did all of that but they still don't work.  I contacted them again and told them this.  Now, I hear nothing from them.  I guess you get what you pay for.Follow up:  The company did finally send me replacements.", "I previously had Samsung Galaxy earbuds until I lost one of them. In comparison:*Fit: These earbuds do not stay in my ears as easily as the Galaxy earbuds. For some reason, the right earbud fits better than the left earbud (not sure whether my ears versus the earbuds are asymmetric). They do not often fall out, and I've completed several treadmill runs without issue, but need to adjust the earbud in my left ear every few minutes while running.*Sound quality: Not great sound quality, but I think that's something people adapt to and quickly cease to notice.*Shape: The earbuds are rather large, at least in comparison to the Galaxy earbuds, and I often accidentally knock them out of my ears while putting on/removing a mask (I'm leaving this review during the COVID-19 pandemic).*Manual controls: Pressing the button to start/stop media hurts a bit. Unlike the Galaxy earbuds, which sensed even a light touch of the fingertips, these earbuds require manually depressing a small button and it hurts my ear a bit to do that.*Microphone: Like most earbuds, the microphone doesn't measure up to speaking into your phone directly but people can at least understand what I say.*Charging case: No issues yet. Placing the large earbuds in the charging case is a bit awkward but it works.*Bluetooth connection: The connection works well. The earbuds say \"Connected\" when you place them in your ear, which is a bit jarring compared to the Galaxy earbuds which played a pleasant tone. On the other hand, one advantage of these earbuds is that they do not disconnect 10 minutes into every run like the Galaxy earbuds did--that is, they do not sense my motion while running and falsely assume I am no longer wearing the earbuds.Overall, I'm satisfied with the product and haven't encountered serious issues, but I feel there are noticeable drawbacks compared to the Galaxy earbuds.", "I don’t typically write reviews but I want to be honest about this product. It’s everything it says it is. Great quality and an amazing battery life!!! However, there were a few factors that made me choose to return this product and spend the money to purchase actual Apple AirPods. The big reason is that these pods are larger than Apple earphones and after only wearing them for about an hour they started to hurt my ears. I was finding that I’d continue to choose my Apple earbuds over these wireless pods because of that and they kept falling out of my ear. I’m giving this 4 stars because I think this is a great product, just not for me because of the sizing.", "I have tried several wireless earphones, and these were by far the best. They connect quickly to my iPhone 11.  They fit perfectly within my ear. The sound is true to life. It is not muffled or tinny sounding. They have a long battery life. The one thing I like best about them is that when I touch the earpiece to adjust it while in my ear, it doesn't cause the audio on the phone to skip forward or back or stop. On these, you have to push a button on the earpiece before it does anything. And the price is amazing. These are exactly what I was looking for. I'm so glad I purchased them.", "These earbuds are a GREAT alternative to Apple’s overpriced buds. I have used Apple’s for several years now, and I can’t tell the difference aside from the price. The sound quality is impeccable— I bumped some WuTang to make sure they could handle the bass and sure enough, they bump! I really like the multifunction button. They turned on and paired seamlessly. They’re very comfortable— even with a tragus piercing. I’ve been so worried about losing my Apple pair because the replacement would be too pricey, but honestly, knowing these are an option makes me breathe a little easier. The only downside I could see (which, to me, isn’t a huge detriment) is the charger. If you have an Apple phone, it’s convenient to charge with the same charger as your phone. But these have excellent battery life so it hasn’t been an inconvenience for me yet. If any of this changes, I’ll be sure to update my review. For now— I highly recommend!", "These earbuds cost about $30. I have another pair of google pixel buds that cost around $170 brand new. Those pixel buds have amazing sound quality, feel solid, and they pair effortlessly. Truly great earbuds and worth the money.However, I also don't like that most premium ear buds stick in your ear with the rubber piece. Oftentimes I prefer the feel of the old-school apple headphones that were all hard white plastic that just sort of sat in your ear without going deep inside it. Those are much more comfortable to me.That's why I bought these cheaper $30 earbuds.The bad with these earbuds:- The sound quality is not as good as google pixel buds. Overall audio quality is sort of 'muddy', especially while listening to music. I mainly listen to audio books and podcasts so it's not a big deal to me.- Battery problems. Sometimes the earbuds don't charge very well. There has been a couple times where I went to the gym and pulled out these headphones only to realize they were dead. I've solved that problem by keeping them plugged in whenever I'm not using them.- They feel cheap. They are extremely lightweight compared to my pixel buds, and not in a good way.So why am I giving these 5 stars? Because they are INEXPENSIVE. I mean come on, 30 bucks for earbuds that do 80% of what the google pixel buds do? That is a steal.They are also fairly comfortable. These have replaced my pixel buds as my go-to audio device. They look good too, especially in black.If you are looking for a cheap pair of beater blue tooth earbuds and you like the feel of the hard plastic rather than the rubber tips, I would go for these in a heartbeat. When these break I'm sure I'll just buy some more from the same company. They are fantastic.", "I had Apple earbuds and loved them, but didn't want to pay $125+ for a new pair. I purchased these to try before spending that much money. I received them today and have to say that they are better than I expected them to be. They're comfortable for me, which is very important. I'm petite and I have tiny ears, the last pair I tried actually hurt.These earbuds sound better than expected, they're comfortable, charge lasted about as long as my Apple ones did, and they're under $30. If you're hesitant to drop a bunch of money on Apple replacement earbuds, try these. Good possibility you'll be as pleased with them as I am.", "I am impressed with the quality of these wireless earbuds.  Being only a fraction of the cost of Apple airpods, I am shocked at the way they closely resemble Apple's version.  The multifunction button is easy to operate to answer calls, reject calls, and switch between songs (with a clear instruction manual provided for guidance).  I believe the only thing that these airpods will not do independently is control the volume output.  However, for the price paid, I will happily use my phone to control the volume that is playing through the devices.  They fit snugly in my ears, and I have not had any issues with them falling out as I am exercising/working out.  They are a great value purchase with excellent sound quality and they closely resemble their counterparts that are almost $100 more expensive!  Highly recommend!"], "Anker Soundcore Liberty Air 2 Pro True Wireless Earbuds, Targeted Active Noise Cancelling, PureNote Technology, LDAC, 6 Mics for Calls, 26H Playtime, HearID Personalized EQ, Wireless Charging": ["UPDATE 1/26/21: While I unfortunately can't in good faith increase my ranking of this product (though I hope an update will address my issues), I have to add how awesome Soundcore/Anker support is. Soundcore reached out to me after I posted my review and has been in constant contact with me, asking if firmware updates addressed my issues and following up with what my issues were.It's truly refreshing to see a company care this much about their customer's experience with their products. My experience with Anker/Soundcore support has always been top notch, but this was above and beyond what I would have expected for a company whose product I said less than favorable things about.All in all, if you want a company that stands behind their products, look no further than Anker/Soundcore/Eufy/Roav/Nebula.ORIGINAL: I was excited to get these, ordering them the day they were released. Unfortunately they don’t hold up the hype.During the announcement of these headphones, they went on and on about how the ANC was tuned to keep the music as “the artist intended it\", but this didn't pan out in reality. All media played with ANC on is crunchy and manipulated making listening unbearable. The high end peaks, hisses and pops, making the driver sound like it's tearing itself apart. The mid-low to low end sounds muffled and distant. In general the soundstage feels narrow, almost as if you are listening in mono and not stereo. All this results in feeling like you are listening on a  dollar store pair of earphones.ANC on without media playing continues my disappointment. With a TV on in the background at a regular listening volume, ANC does manage to “reduce the volume”; However, it was still clearly audible and I didn't struggle at all to understand what was being said. That in itself is a pretty big let down, making the ANC on these feel more a gimmick than a key feature.On the brightside, if you turn ANC off, audio is just as good as you’d expect from Soundcore; crisp and bass-y with a soundstage wider than a pair of earphones at this price point should offer. But that is beyond the point. While this could possibly be addressed with some firmware updates, I am not a fan of buying a product for a broken feature hoping it will be fixed in the future.Now to some things beyond ANC.The earphones themselves are super comfortable, more comfortable than my Liberty 2 Pro (I attribute this to the lack of a wing tip). They come with with every size imaginable of ear tip, which are now labeled next to every set so you know the size, so you are sure to find your match, which results in always getting a good and stable fit in your ear. Unfortunately, unlike the liberty 2 pro’s the ear tips don’t come on a card that can be separated from the box, so keeping the ear tips means keeping the whole box or cut them out of the box.The battery case is pretty nice, but the sliding mechanism of the door feels a bit and wobbly. There is a noticeable gap when the door is closed and has the travel side to side of a joystick making it not feel as premium or durable as the Liberty 2 Pro Door. The finish is nice, with a soft touch the borders on a bit slippery but forgivable. The earphones are easy to remove and are stably held in by a strong magnet.Overall, the main promise was not delivered so they will being a return from me. Hopefully soundcore is able to address the issues on what otherwise is a nice product.", "I have the Soundcore Life P2's, Liberty Air 2's, and now the Liberty Air 2 Pros.I really like the case and I think the sound quality is better than the other two sets of buds I have with Soundcore.There are a few issues that I have which unfortunately for me are dealbreakers.1. There is a delay in the audio when watching videos. I've noticed it more on Youtube, but it's enough where watching videos is frustrating.2. For some reason, these earbuds are not very comfortable for me, which is odd, because I can wear the Liberty Air 2's for a long time with no problem. Maybe I need to look at a foam ear tip?3. I'm also having the same issue where there seems to be little to no difference between normal, noise cancelling, and ambient modes. I often have to check my phone to see which mode I'm on, since they all sound so similar.On a positive note, these sound awesome and everyone I've talked to said these sound significantly better than the Air 2's on a phone call.I'm not sure if I got a bad set or if a firmware update can fix these issues. I'll likely be returning them though.", "Great first impressions! I'm comparing to my current Bose Soundsport wireless headphones and I will be selling those on FB marketplace as soon as I'm finished writing this.The medium sized buds they came with are just a hair uncomfortable so I switched to the medium+ size offered in the box and a much better fit for me. I tried all the other sizes just to see and this is just what worked.I downloaded the app and instantly did the firmware update. Once complete I started messing with all the ACN settings. I was in my car in the parking lot idling and could barely hear the engine in \"transport\" mode, when I got home I could barely hear the baby crying in \"inside\" mode so a big win there. To those that reviewed hearing a crackling noise with the ACN, did you do the firmware update? If so and if that didn't fix it, is your cheek touching the tip of the headphone? So far I haven't had any issues and I toggled with all the settings on the ACN and really happy with it. The only crackling I heard was when my cheek rubbed up against the tip of the headphones microphone and a quick adjustment in my ear fixed that.I haven't worked out with these yet but I did an aggressive head shake and with the right sized buds I didn't lose a headphone out of my head. A sweaty HIIT workout will be the true test later, but as of right now I'm not concerned.Lastly the EQ settings are great once you find the one that suits you. I personally liked the classical or R&B preset EQ but I ultimately just customized my own. Make sure you try different EQ settings with ACN on and off, they sound different so adjust accordingly.My one complaint is the touch settings, they could be a little more sensitive but it just might be me not tapping perfectly in the right spot. I do like that you can customize what the tap settings do to suit your needs.", "Just received them and so far I’m loving them I have multiple Soundcore headphones and these are the best even compared to the Soundcore liberty pro 2 those have a annoying hiss that a lost of the liberty pro 2s had.The blue looks awesome and matches the iPhones blueConnecting these was super easy no issues. The first thing you have to do is set up hearID with the app. This will make the earbuds sound much better the. They already do.Playing with the ANC desperately needs an update. There’s different modes and custom so far I can’t tell the difference on or off and transparency mode does absolutely nothing but I’m sure these things can be fixed with an update so for now I wouldn’t get these if you are buying them for ANC.They look awesome and sound awesome but the ANC needs updating. I haven’t used them for phone calls yet so I’ll update this review once the headphones get updated to see if there’s any improvements to the ANC", "Huge disappointment! I own other Anker headphones and love them. These earbuds come with 9 tips yet none of them fit good enough to not feel like they were falling out of my ears and they literally did fall out.  They were also too loose in my ears to block out surrounding noise. They sounded tinny but I think I could have fixed that if I could have gotten them to connect to the app. I have returned them. Anker tried to refund my money via a gift card. I did not want a gift card and I’m still waiting to get my money refunded.", "I got them in pink. Very beautifully packaged and presented. The variety of tips was nice. They sound good, no lie, but the squeal when i put them in, the touch controls being wonky at best and the GINORMOUS driver causing these to never fit properly.... yeah im returning them. I have small ears and narrow canals, i have issues with most bud style earphones fitting properly, so i can almost overlook that, but for 130??? no, go get galaxy buds now that the pros are out and they are on discount. Had mine since they were released and they are 100x better on sound, anc, fit and touch control.*Quick edit (01/27/21)* While i did return this product, i want to commend the customer satisfaction team from Soundcore. They really do read the reviews and want their customers to have the best experience possible. While this didn't work out for me, it will not deter my buying their products in the future.", "Like others who ordered early, I have a pair of Anker earbuds that I love so I was excited to get these. Unfortunately, they do not have buds that fit my ears (because the stalk does not go deep enough to create a seal). Without the seal, the ANC is not very good and they rattle around in my ears and make noise when I move. I do not have this issue with my other Anker Earbuds that cost $20.00 so I cannot accept that for ones that I paid $100 for. Unfortunately, I had to send them back.I gave 2 stars becuase the case was nice, the app worked well but they fail where it matters the most.", "Updated.Anker reached out and tried their best to rectify the issues. Swapping the tips for other types has helped a lot. I have white ear buds and smoke tips now but they seem to work a lot better.The price has come down to $80 and at that I think they are worth it.An unbelievable amount of waste for a set of earbuds. Nothing but plastic.Anker is right up there with apple on the waste of the packaging. There is no way to remove the earbuds from the package without scratching them as they are so form fitted into the molded plastic packaging.There are an array of eartips to customize the fit but as they are displayed in the box for storage, I am stuck with holding on to this massive box to only keep the ear tips organized.The case opening is flimsy and suspect it will have a short life.The ANC that is promised is closer to the dolby noise reduction of years past. It adjusts the music to a horrible tone and does not really work to block the ambient noise.The app and tone controls are good. The hearing ID was not really accurate and needed to be adjusted manually.The buds are comfortable as the Liberty Air 2, if you do not need the inductive charging. Save your money and wait for those to go on sale.These are NOT worth $130", "Update to downgrade to one star as the only way to get these to switch from one device to another is by forgetting and re synching.  But resybching will not happen if your other synched device is on, you will have to power off the iPhone hard  to resynch to the iPad to switch its connection.  The absolutely worst implementation of bluetooth I’ve ever tried; even the cheapest imitation earbuds bought off the street will work better than these.  I would not recommend these, period since the bluetooth is so bad (and yes I have the latest firmwear as of end of Mar 21).First the good, these fit better than probably any other bluetooth earbuds, and the case is really nice.  The sound is pretty good for earbuds, of course headphones are better so they aren’t perfect, but about as good as can be expected given the price.  The noise cancelling, at least walking around outside and inside, is not as good as the Apple Pros, but not bad.  And the mode where you listen to other people talking is better than with the Apple.  The battery is slightly better than Apple’s, but not as good as advertised.  The control app is actually nicer than using the Apple integrated controls, so that is nice.  They work okay for phone calls too, about what you would expect; but most earbuds seem to work well for that function.  But the really bad, if you have more than one device, is they are a major pain switching from say your iPad to iPhone and vice versa.  You often have to forget them and repair.  So if you just want to use them with one device, and only pair them with that device, I would recommend them as they aren’t bad for the price.  If you want to pair, and use, with more than one device I would absolutely not recommend these.  They are an exercise in frustration with more than one device.", "Overall, I really like these earbuds. I am not a audiophile, but I do notice sound quality and want something that is better than average. I can tell they aren't going to match the highest quality, highest price pair of headphones out there (there can be some distortion, especially with some songs with more bass). I joke with my wife that I am a collector of earbuds/headphones as I seem to be on constant pursuit of my next pair (each a very different style as I like different styles for different uses). Before this set, my favorite pair was probably my Jabra 85h. Being an over ear headset, though, they would often get too warm if I used them while exercising or too bulky looking when on a webcam visit. So, I wanted to find a better pair of earbuds than I previously had tried.The pros of the Soundcore Liberty Air 2 Pro:Look greatUseful app that customizes the sound (especially now that they added volume controls as an option)I prefer the touch buttons that don't require a hard pressSound greatActive Noise Cancellation is quite effective--especially with the variety of noise cancellation settingsThe cons:(SEE UPDATE) While you can customize the function of the touch buttons, there is no option to change the volume with the touch buttons. This was a surprise because my wife has the Liberty Air 2, and that was an option on hers. Not sure why they removed some of the customization options.Wearing them HURT in my ears. I had to buy memory foam tips that were longer. Now they are not great, but pretty good (instead of hurting within minutes, I can wear them comfortably for 2+ hours before they start to become uncomfortable). The tips that came with them (I tried the different sizes) would hurt bad enough I could barely make it through an hour-long meeting. I believe, for me, the problem was the shape of the round end of the earbud doesn't fit well in my ear. Once I found foam tips that were longer, the earbud could stay in my ear firmly (they also improved noise cancellation) but the hard earbud didn't have to be pressed in as far and the comfort significantly improved.(SEE UPDATE) The battery life is no where near advertised. I am hoping this is a problem with my set and I am looking to get them replaced--not that it is true to every pair created. I have reached out to the company (my experience with Anker in the past with their other products has been excellent and I believe they are the company that makes the Soundcore earbud). They advertise lasting 7 hours and getting 3 charges from the case. They often felt like they would run out much quicker, so today I paid closer attention and tracked my use. They finished fully charging in the case 100% when I started using them this morning. I was using them for 5 hours--almost 3 hours on phone calls, the other 2 hours I was wearing but not listening to any sound (a small amount of that time I wasn't wearing them at all). Then I received the \"low battery\" notice and checked the app--which showed they were about to die. Also, I only get 1 to 1.5 charges from my case before I need to recharge the case. Now, the case does recharge fast and the earbuds recharge fast in the case (I haven't timed either to say exactly, but I am surprised to see how quickly they charge ... and a quick 15 minute charge does give me enough to do another hour-long call). Given that I mainly purchased these to do my work meetings (which are now all virtual) and I work 8-hour days with 4-6 hours of meetings some days, I was expecting them to last the 7 hours so I wouldn't have to worry about them dying on my in the middle (or sooner) of my day.(SEE UPDATE) Again, I hope the company will replace my current set and the new ones last as advertised. I also feel they are not perfectly comfortable for extended wear, but do significantly better with my foam tips (of course, everyone's ears will be different and I read reviews that said they were very comfortable and others who also needed to replace the supplied tips with foam ones).Currently, I would grade them a \"B\". If they can resolve my battery issues and I base my rating on the comfort after I replaced the tips, I would grade them an A- or even an A.UPDATE 3-4-21: First off, let me say that you are going to have a hard time finding better customer service than you will get with Anker/Soundcore. I reached out to the company with my concerns. They very quickly responded and offered to send me a replacement pair. Unfortunately, they were out of the blue pair I purchased. They also offered to send the blue pair as soon as they were in stock. They have followed up to make sure the replacements were meeting my needs.The replacement earbuds have resolved some of the concerns that I had. They are holding a longer charge--although still less than I had hoped. This may be due to optional settings--volume, noise cancellation, etc. I get somewhere from 3-4 hours of use (meaning time on a call, with maybe 1-2 additional hours of downtime between calls where they are still on). What did significantly improve with the new pair was that the case now charges my earbuds 2.5-3 times. I am also very impressed with how quickly the case itself charges (I use a wireless charging pad) and how quickly the case charges my earbuds. So, while it would be great if they lasted a full day on 1 charge, instead they can last a full day because I can quickly charge for even just 15 minutes between meetings to get more than enough to add an extra hour or more.I also found the replacement pair has improved the noise cancellation. It won't block out 100% sound (especially depending on the frequency), but I was amazed when I put them on once when my son was practicing his violin. I had to remove them to check to see if he stopped playing as I was amazed that I couldn't hear it anymore (maybe they should market them to parents with kids learning a new instrument :).I also was very glad to see that they had updated the app and now I can choose volume + and - as customizable options for the touch controls. I hope they continue to add more customization options (one tap, double tap and hold for 2s ... currently they don't have an option for single tap). I had to choose between several options I wanted because of the lack of a single tap option. But, I was glad I could now choose volume as that is a much more common need when using them.Overall, they are a great pair of earbuds and I don't see me needing to go hunting for a replacement pair anytime soon. When I do, the quality of these and of their customer support will have me starting my hunt with something made by Anker."]}